app/views/users/show.html.erb

SELECT "places".* FROM "places" WHERE "places"."user_id" = $1  [["user_id", 2]]
---
<p><b>Nom:</b> <%= @user.last_name %></p>
    <% @user.places.each do |usr|%>