app/views/users/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          <div class="card-header font-italic">
            by <%= itm.user.first_name if itm.user %>