app/views/items/show.html.erb

<h5>Les photos </h5>
    <% @item.images.each do |img|%>
---
SELECT "images".* FROM "images" WHERE "images"."item_id" = $1  [["item_id", 1]]