app/controllers/img_products_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def create
      @item = Item.find(params[:item_id])