app/controllers/items_controller.rb

  def create
    @item = Item.new(title: params[:title], description: params[:description],price: params[:price],location: params[:location],img_url: params[:img_url])

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-12-09 15:11:07.677837"], ["updated_at", "2021-12-09 15:11:07.677837"]]