app/controllers/items_controller.rb

  def create

    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("title", "summary", "description", "price", "available_duration", "available_start", "available_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update

    @item = Item.find(params[:id])
    item_params = params.require(:item).permit(:title,:description,:price,:summary, :available_duration, :available_start, :available_end, images_attributes: [:title,:format,:url_item_img])
    if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "price" = $1, "available_duration" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["price", 1234], ["available_duration", 10], ["updated_at", "2021-12-14 18:46:19.323689"], ["id", 1]]