app/controllers/orders_controller.rb

SELECT  "items".* FROM "items" ORDER BY "items"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @item =Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    order= Order.new
    order.save
    @item = Item.all.find_by(id:params[:id])