app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "bio" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Luke"], ["last_name", ""], ["bio", ""], ["updated_at", "2021-12-14 17:28:49.329660"], ["id", 2]]
---
    def update
      @user = current_user
      user_params = params.require(:user).permit(:first_name,:last_name,:bio,:date_of_birth, :phone_number, :profile_picture, places_attributes: [:city_name, :zip_code, :address, :latitude, :longitude])
      @user.update(user_params)